package Seminars.Game.Units;

public enum NamesFantazy{
    Агна, Кили, Чучхек, Лэйхо, Далгал, Хитоэль, Даин, Таклинн, Олориц, Маухур, Наугрим, Тристрид, Еберк, Нирнаэт,
    Ксанафия, Сильмарил, Грантрим, Адрик, Нинглорон, Хэйян, Нинниах, Эльвинг, Мэтэстэль, Анбера, Илде,
    Кэлэрдайн, Глох, Эхор, Лоск, Арноэдиад, Друсилиа, Нимрайс, Турукано, Дунгортэб, Мабергор, Эльдалиэва, Карог, Сэдрин,
    Цэрлэг, Адэртад, Азог, Аннун, Риардон, Бэлэг, Антинуа, Арвэн, Индис, Карантир, Налаед, Эрэссэа, Эмбер, Ламат, Галадриэль,
    Ндэнгин, Даэрон, Нибин, Маэглин, Янгрит, Хелгрет, Валинорэва, Теирастра, Горгор, Делг, Луин, Химо, Гортад,
    Тэврах, Ангрэн}